# Homebrew Bundle file for mzsh
# Manage taps, formulae, and casks here.

# Taps
# Support multiple .NET SDK versions installed side-by-side
# See: https://github.com/isen-ng/homebrew-dotnet-sdk-versions
tap "isen-ng/dotnet-sdk-versions"

# Bun (official tap for compatibility across Homebrew versions)
tap "oven-sh/bun"

# Formulae
brew "eza"
brew "fish"
brew "gh"
brew "git"
brew "nvm"

# Casks
cask "beyond-compare"
cask "dotnet-sdk8"
cask "dotnet-sdk9"
cask "firefox"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "notunes"
cask "postman"
cask "raycast"
cask "visual-studio-code"